src/config/DataProcessors/ерпсСозданиеАктаПриемаПередачиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ерпсСозданиеАктаПриемаПередачиТовара</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыКПереносу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеАртикулы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеАртикулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктРазгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПунктыРазгрузки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагруженнаяНоменклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагруженноеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагруженныйДополнительныеАртикулы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДЗаявкиКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/config/DataProcessors/ерпсСозданиеАктаПриемаПередачиТовара/Forms/ФормаВыбораСопоставленияМестДоставки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресЗагруженыхДанных = Параметры.АдресЗагруженыхДанных;	
	Т = ПолучитьИзВременногоХранилища(Параметры.АдресЗагруженыхДанных);
	
	ТТ = Т.Скопировать();
	ТТ.Свернуть("ПунктРазгрузкиПоиск,ПунктРазгрузки,ДатаОтгрузки,ИДЗаявкиКлиента");
	
	ПунктыРазгрузки.Загрузить(ТТ);	
	
КонецПроцедуры

&НаСервере
Функция ОКНаСервере()
	
	//Т = ПунктыРазгрузки.Выгрузить();
	//
	//МассивСтрок = Т.НайтиСтроки(Новый Структура("ПунктРазгрузки", ПредопределенноеЗначение("Справочник.ПунктыРазгрузки.ПустаяСсылка")));
	//Для Каждого Эл Из МассивСтрок Цикл
	//	Т.Удалить(Эл);
	//КонецЦикла;

	//Для Каждого Эл Из Т Цикл
	//	Менеджер = РегистрыСведений.а_СвязьОбъектов.СоздатьМенеджерЗаписи();
	//	Менеджер.ИД = Эл.ПунктРазгрузкиПоиск;
	//	Менеджер.ТипОбъекта = ПредопределенноеЗначение("Перечисление.а_ТипыОбъектов.ПунктРазгрузки");
	//	Менеджер.Объект = Эл.ПунктРазгрузки;
	//	Попытка
	//		Менеджер.Записать();
	//	Исключение
	//		ЗаписьЖурналаРегистрации("Сопоставление пунктов разгрузки"
	//			, УровеньЖурналаРегистрации.Ошибка
	//			, Метаданные.РегистрыСведений.а_СвязьОбъектов
	//			,
	//			, ОписаниеОшибки() + Символы.ПС + Эл.ПунктРазгрузкиПоиск
	//		);
	//	КонецПопытки;
	//КонецЦикла;
	//
	//Возврат ПоместитьВоВременноеХранилище(Т);
	
	
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	ОповеститьОЗавершенииРаботыФормы(Истина);
	//Закрыть(ОКНаСервере());
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОЗавершенииРаботыФормы(ОбновлятьТАблицу)
	ОбновитьПорядок = Ложь;
	Индекс = 1;
	Для Каждого СтрокаТЧ Из ПунктыРазгрузки Цикл
		Если СтрокаТЧ.РеквизитДопУпорядочивания <> Индекс Тогда
			ОбновитьПорядок = Истина;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Адрес = ПолучитьАдресТЧ(ОбновлятьТАблицу);
	ОповеститьОВыборе(Адрес);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТЧ(ОбновлятьТАблицу = Истина)
	
	
	Если ОбновлятьТАблицу тогда
		ЗаполнитьТаблицуКПереносу();
	КонецЕсли;
	
	ТЗКПередаче = ЭтотОбъект.КПереносу.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТЗКПередаче);
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуКПереносу()
	
	ЭтотОбъект.КПереносу.Очистить();
	НовТЗ = ЭтотОбъект.ПунктыРазгрузки.Выгрузить();//ВыбранныеМеста.НайтиСтроки(Новый Структура("Выбрана",Истина)));
	НовТЗ.Сортировать("РеквизитДопУпорядочивания Возр");
	Для каждого ТекСтрока из НовТЗ Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.ПунктРазгрузки) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ЭтотОбъект.КПереносу.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Выбрана = Истина;
		НоваяСтрока.Ссылка = ТекСтрока.ПунктРазгрузки;
		НоваяСтрока.Наименование = СокрЛП(ТекСтрока.ПунктРазгрузки) + ?(ПустаяСТрока(ТекСтрока.ИДЗаявкиКлиента),"", " ("+ТекСтрока.ИДЗаявкиКлиента+")");
		НоваяСтрока.РеквизитДопУпорядочивания = ТекСтрока.РеквизитДопУпорядочивания;
		
		ТекСтрока.РеквизитДопУпорядочивания = ТекСтрока.РеквизитДопУпорядочивания + 1;
		
		//Если ТекСтрока.Кількість > 0 тогда
		//	Для ид = 1 по ТекСтрока.Кількість - 1 Цикл
		//		ЗаполнитьЗначенияСвойств(ЭтотОбъект.КПереносу.Добавить(),ТекСтрока);
		//	КонецЦикла;
		//КонецЕсли;
		
		
	КонецЦикла;
КонецПроцедуры
